{"class_name": "Model", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 116, 116, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "batch_input_shape": [null, 116, 116, 1], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu", "inbound_nodes": [[["conv2d", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d", "inbound_nodes": [[["leaky_re_lu", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization", "inbound_nodes": [[["max_pooling2d", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_1", "inbound_nodes": [[["batch_normalization", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_2", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_2", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_2", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv2d_3", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_3", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "batch_normalization_3", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxwAAAB8AGQAZACFAmQBZABkAIUCZABkAIUCZgQZAFMAKQJO\n6QAAAACpACkB2gF0cgIAAAByAgAAAPodZGlsYXRlX0NOTl9STl9jbGFzc2lmeV9uZXcucHnaDWdl\ndF90b3BfZGltXzGlAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]], [["lambda_1", 0, 0, {}]], [["lambda_1", 1, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcyAAAAB8AGQAZACFAmQBZACFAmQAZACFAmQAZACFAmYEGQBT\nACkCTukBAAAAqQApAdoBdHICAAAAcgIAAAD6HWRpbGF0ZV9DTk5fUk5fY2xhc3NpZnlfbmV3LnB5\n2hVnZXRfYWxsX2J1dF90b3BfZGltXzGoAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_1", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]], [["lambda_1", 0, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxoAAAB8AGQAZACFAmQBZACFAmQAZACFAmYDGQBTACkCTukB\nAAAAqQApAdoBdHICAAAAcgIAAAD6HWRpbGF0ZV9DTk5fUk5fY2xhc3NpZnlfbmV3LnB52hVnZXRf\nYWxsX2J1dF90b3BfZGltXzKuAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_3", "inbound_nodes": [[["lambda", 0, 0, {}]], [["lambda_3", 0, 0, {}]], [["lambda", 1, 0, {}]], [["lambda_3", 2, 0, {}]], [["lambda", 2, 0, {}]], [["lambda_3", 4, 0, {}]]]}, {"class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxYAAAB8AGQAZACFAmQBZABkAIUCZgMZAFMAKQJO6QAAAACp\nACkB2gF0cgIAAAByAgAAAPodZGlsYXRlX0NOTl9STl9jbGFzc2lmeV9uZXcucHnaDWdldF90b3Bf\nZGltXzKrAAAAcwIAAAAAAQ==\n", null, null], "function_type": "lambda", "module": "__main__", "output_shape": null, "output_shape_type": "raw", "output_shape_module": null, "arguments": {}}, "name": "lambda_2", "inbound_nodes": [[["lambda", 0, 0, {}]], [["lambda_3", 0, 0, {}]], [["lambda_3", 1, 0, {}]], [["lambda", 1, 0, {}]], [["lambda_3", 2, 0, {}]], [["lambda_3", 3, 0, {}]], [["lambda", 2, 0, {}]], [["lambda_3", 4, 0, {}]], [["lambda_3", 5, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate", "trainable": true, "dtype": "float32", "axis": -1}, "name": "concatenate", "inbound_nodes": [[["lambda_2", 0, 0, {}], ["lambda_2", 0, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_2", 1, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_2", 2, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_2", 3, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_2", 4, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_2", 5, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_2", 6, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_2", 7, 0, {}]], [["lambda_2", 0, 0, {}], ["lambda_2", 8, 0, {}]], [["lambda_2", 1, 0, {}], ["lambda_2", 0, 0, {}]], [["lambda_2", 1, 0, {}], ["lambda_2", 1, 0, {}]], [["lambda_2", 1, 0, {}], ["lambda_2", 2, 0, {}]], [["lambda_2", 1, 0, {}], ["lambda_2", 3, 0, {}]], [["lambda_2", 1, 0, {}], ["lambda_2", 4, 0, {}]], [["lambda_2", 1, 0, {}], ["lambda_2", 5, 0, {}]], [["lambda_2", 1, 0, {}], ["lambda_2", 6, 0, {}]], [["lambda_2", 1, 0, {}], ["lambda_2", 7, 0, {}]], [["lambda_2", 1, 0, {}], ["lambda_2", 8, 0, {}]], [["lambda_2", 2, 0, {}], ["lambda_2", 0, 0, {}]], [["lambda_2", 2, 0, {}], ["lambda_2", 1, 0, {}]], [["lambda_2", 2, 0, {}], ["lambda_2", 2, 0, {}]], [["lambda_2", 2, 0, {}], ["lambda_2", 3, 0, {}]], [["lambda_2", 2, 0, {}], ["lambda_2", 4, 0, {}]], [["lambda_2", 2, 0, {}], ["lambda_2", 5, 0, {}]], [["lambda_2", 2, 0, {}], ["lambda_2", 6, 0, {}]], [["lambda_2", 2, 0, {}], ["lambda_2", 7, 0, {}]], [["lambda_2", 2, 0, {}], ["lambda_2", 8, 0, {}]], [["lambda_2", 3, 0, {}], ["lambda_2", 0, 0, {}]], [["lambda_2", 3, 0, {}], ["lambda_2", 1, 0, {}]], [["lambda_2", 3, 0, {}], ["lambda_2", 2, 0, {}]], [["lambda_2", 3, 0, {}], ["lambda_2", 3, 0, {}]], [["lambda_2", 3, 0, {}], ["lambda_2", 4, 0, {}]], [["lambda_2", 3, 0, {}], ["lambda_2", 5, 0, {}]], [["lambda_2", 3, 0, {}], ["lambda_2", 6, 0, {}]], [["lambda_2", 3, 0, {}], ["lambda_2", 7, 0, {}]], [["lambda_2", 3, 0, {}], ["lambda_2", 8, 0, {}]], [["lambda_2", 4, 0, {}], ["lambda_2", 0, 0, {}]], [["lambda_2", 4, 0, {}], ["lambda_2", 1, 0, {}]], [["lambda_2", 4, 0, {}], ["lambda_2", 2, 0, {}]], [["lambda_2", 4, 0, {}], ["lambda_2", 3, 0, {}]], [["lambda_2", 4, 0, {}], ["lambda_2", 4, 0, {}]], [["lambda_2", 4, 0, {}], ["lambda_2", 5, 0, {}]], [["lambda_2", 4, 0, {}], ["lambda_2", 6, 0, {}]], [["lambda_2", 4, 0, {}], ["lambda_2", 7, 0, {}]], [["lambda_2", 4, 0, {}], ["lambda_2", 8, 0, {}]], [["lambda_2", 5, 0, {}], ["lambda_2", 0, 0, {}]], [["lambda_2", 5, 0, {}], ["lambda_2", 1, 0, {}]], [["lambda_2", 5, 0, {}], ["lambda_2", 2, 0, {}]], [["lambda_2", 5, 0, {}], ["lambda_2", 3, 0, {}]], [["lambda_2", 5, 0, {}], ["lambda_2", 4, 0, {}]], [["lambda_2", 5, 0, {}], ["lambda_2", 5, 0, {}]], [["lambda_2", 5, 0, {}], ["lambda_2", 6, 0, {}]], [["lambda_2", 5, 0, {}], ["lambda_2", 7, 0, {}]], [["lambda_2", 5, 0, {}], ["lambda_2", 8, 0, {}]], [["lambda_2", 6, 0, {}], ["lambda_2", 0, 0, {}]], [["lambda_2", 6, 0, {}], ["lambda_2", 1, 0, {}]], [["lambda_2", 6, 0, {}], ["lambda_2", 2, 0, {}]], [["lambda_2", 6, 0, {}], ["lambda_2", 3, 0, {}]], [["lambda_2", 6, 0, {}], ["lambda_2", 4, 0, {}]], [["lambda_2", 6, 0, {}], ["lambda_2", 5, 0, {}]], [["lambda_2", 6, 0, {}], ["lambda_2", 6, 0, {}]], [["lambda_2", 6, 0, {}], ["lambda_2", 7, 0, {}]], [["lambda_2", 6, 0, {}], ["lambda_2", 8, 0, {}]], [["lambda_2", 7, 0, {}], ["lambda_2", 0, 0, {}]], [["lambda_2", 7, 0, {}], ["lambda_2", 1, 0, {}]], [["lambda_2", 7, 0, {}], ["lambda_2", 2, 0, {}]], [["lambda_2", 7, 0, {}], ["lambda_2", 3, 0, {}]], [["lambda_2", 7, 0, {}], ["lambda_2", 4, 0, {}]], [["lambda_2", 7, 0, {}], ["lambda_2", 5, 0, {}]], [["lambda_2", 7, 0, {}], ["lambda_2", 6, 0, {}]], [["lambda_2", 7, 0, {}], ["lambda_2", 7, 0, {}]], [["lambda_2", 7, 0, {}], ["lambda_2", 8, 0, {}]], [["lambda_2", 8, 0, {}], ["lambda_2", 0, 0, {}]], [["lambda_2", 8, 0, {}], ["lambda_2", 1, 0, {}]], [["lambda_2", 8, 0, {}], ["lambda_2", 2, 0, {}]], [["lambda_2", 8, 0, {}], ["lambda_2", 3, 0, {}]], [["lambda_2", 8, 0, {}], ["lambda_2", 4, 0, {}]], [["lambda_2", 8, 0, {}], ["lambda_2", 5, 0, {}]], [["lambda_2", 8, 0, {}], ["lambda_2", 6, 0, {}]], [["lambda_2", 8, 0, {}], ["lambda_2", 7, 0, {}]], [["lambda_2", 8, 0, {}], ["lambda_2", 8, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["concatenate", 0, 0, {}]], [["concatenate", 1, 0, {}]], [["concatenate", 2, 0, {}]], [["concatenate", 3, 0, {}]], [["concatenate", 4, 0, {}]], [["concatenate", 5, 0, {}]], [["concatenate", 6, 0, {}]], [["concatenate", 7, 0, {}]], [["concatenate", 8, 0, {}]], [["concatenate", 9, 0, {}]], [["concatenate", 10, 0, {}]], [["concatenate", 11, 0, {}]], [["concatenate", 12, 0, {}]], [["concatenate", 13, 0, {}]], [["concatenate", 14, 0, {}]], [["concatenate", 15, 0, {}]], [["concatenate", 16, 0, {}]], [["concatenate", 17, 0, {}]], [["concatenate", 18, 0, {}]], [["concatenate", 19, 0, {}]], [["concatenate", 20, 0, {}]], [["concatenate", 21, 0, {}]], [["concatenate", 22, 0, {}]], [["concatenate", 23, 0, {}]], [["concatenate", 24, 0, {}]], [["concatenate", 25, 0, {}]], [["concatenate", 26, 0, {}]], [["concatenate", 27, 0, {}]], [["concatenate", 28, 0, {}]], [["concatenate", 29, 0, {}]], [["concatenate", 30, 0, {}]], [["concatenate", 31, 0, {}]], [["concatenate", 32, 0, {}]], [["concatenate", 33, 0, {}]], [["concatenate", 34, 0, {}]], [["concatenate", 35, 0, {}]], [["concatenate", 36, 0, {}]], [["concatenate", 37, 0, {}]], [["concatenate", 38, 0, {}]], [["concatenate", 39, 0, {}]], [["concatenate", 40, 0, {}]], [["concatenate", 41, 0, {}]], [["concatenate", 42, 0, {}]], [["concatenate", 43, 0, {}]], [["concatenate", 44, 0, {}]], [["concatenate", 45, 0, {}]], [["concatenate", 46, 0, {}]], [["concatenate", 47, 0, {}]], [["concatenate", 48, 0, {}]], [["concatenate", 49, 0, {}]], [["concatenate", 50, 0, {}]], [["concatenate", 51, 0, {}]], [["concatenate", 52, 0, {}]], [["concatenate", 53, 0, {}]], [["concatenate", 54, 0, {}]], [["concatenate", 55, 0, {}]], [["concatenate", 56, 0, {}]], [["concatenate", 57, 0, {}]], [["concatenate", 58, 0, {}]], [["concatenate", 59, 0, {}]], [["concatenate", 60, 0, {}]], [["concatenate", 61, 0, {}]], [["concatenate", 62, 0, {}]], [["concatenate", 63, 0, {}]], [["concatenate", 64, 0, {}]], [["concatenate", 65, 0, {}]], [["concatenate", 66, 0, {}]], [["concatenate", 67, 0, {}]], [["concatenate", 68, 0, {}]], [["concatenate", 69, 0, {}]], [["concatenate", 70, 0, {}]], [["concatenate", 71, 0, {}]], [["concatenate", 72, 0, {}]], [["concatenate", 73, 0, {}]], [["concatenate", 74, 0, {}]], [["concatenate", 75, 0, {}]], [["concatenate", 76, 0, {}]], [["concatenate", 77, 0, {}]], [["concatenate", 78, 0, {}]], [["concatenate", 79, 0, {}]], [["concatenate", 80, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_4", "inbound_nodes": [[["dense", 0, 0, {}]], [["dense", 1, 0, {}]], [["dense", 2, 0, {}]], [["dense", 3, 0, {}]], [["dense", 4, 0, {}]], [["dense", 5, 0, {}]], [["dense", 6, 0, {}]], [["dense", 7, 0, {}]], [["dense", 8, 0, {}]], [["dense", 9, 0, {}]], [["dense", 10, 0, {}]], [["dense", 11, 0, {}]], [["dense", 12, 0, {}]], [["dense", 13, 0, {}]], [["dense", 14, 0, {}]], [["dense", 15, 0, {}]], [["dense", 16, 0, {}]], [["dense", 17, 0, {}]], [["dense", 18, 0, {}]], [["dense", 19, 0, {}]], [["dense", 20, 0, {}]], [["dense", 21, 0, {}]], [["dense", 22, 0, {}]], [["dense", 23, 0, {}]], [["dense", 24, 0, {}]], [["dense", 25, 0, {}]], [["dense", 26, 0, {}]], [["dense", 27, 0, {}]], [["dense", 28, 0, {}]], [["dense", 29, 0, {}]], [["dense", 30, 0, {}]], [["dense", 31, 0, {}]], [["dense", 32, 0, {}]], [["dense", 33, 0, {}]], [["dense", 34, 0, {}]], [["dense", 35, 0, {}]], [["dense", 36, 0, {}]], [["dense", 37, 0, {}]], [["dense", 38, 0, {}]], [["dense", 39, 0, {}]], [["dense", 40, 0, {}]], [["dense", 41, 0, {}]], [["dense", 42, 0, {}]], [["dense", 43, 0, {}]], [["dense", 44, 0, {}]], [["dense", 45, 0, {}]], [["dense", 46, 0, {}]], [["dense", 47, 0, {}]], [["dense", 48, 0, {}]], [["dense", 49, 0, {}]], [["dense", 50, 0, {}]], [["dense", 51, 0, {}]], [["dense", 52, 0, {}]], [["dense", 53, 0, {}]], [["dense", 54, 0, {}]], [["dense", 55, 0, {}]], [["dense", 56, 0, {}]], [["dense", 57, 0, {}]], [["dense", 58, 0, {}]], [["dense", 59, 0, {}]], [["dense", 60, 0, {}]], [["dense", 61, 0, {}]], [["dense", 62, 0, {}]], [["dense", 63, 0, {}]], [["dense", 64, 0, {}]], [["dense", 65, 0, {}]], [["dense", 66, 0, {}]], [["dense", 67, 0, {}]], [["dense", 68, 0, {}]], [["dense", 69, 0, {}]], [["dense", 70, 0, {}]], [["dense", 71, 0, {}]], [["dense", 72, 0, {}]], [["dense", 73, 0, {}]], [["dense", 74, 0, {}]], [["dense", 75, 0, {}]], [["dense", 76, 0, {}]], [["dense", 77, 0, {}]], [["dense", 78, 0, {}]], [["dense", 79, 0, {}]], [["dense", 80, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_1", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]], [["leaky_re_lu_4", 1, 0, {}]], [["leaky_re_lu_4", 2, 0, {}]], [["leaky_re_lu_4", 3, 0, {}]], [["leaky_re_lu_4", 4, 0, {}]], [["leaky_re_lu_4", 5, 0, {}]], [["leaky_re_lu_4", 6, 0, {}]], [["leaky_re_lu_4", 7, 0, {}]], [["leaky_re_lu_4", 8, 0, {}]], [["leaky_re_lu_4", 9, 0, {}]], [["leaky_re_lu_4", 10, 0, {}]], [["leaky_re_lu_4", 11, 0, {}]], [["leaky_re_lu_4", 12, 0, {}]], [["leaky_re_lu_4", 13, 0, {}]], [["leaky_re_lu_4", 14, 0, {}]], [["leaky_re_lu_4", 15, 0, {}]], [["leaky_re_lu_4", 16, 0, {}]], [["leaky_re_lu_4", 17, 0, {}]], [["leaky_re_lu_4", 18, 0, {}]], [["leaky_re_lu_4", 19, 0, {}]], [["leaky_re_lu_4", 20, 0, {}]], [["leaky_re_lu_4", 21, 0, {}]], [["leaky_re_lu_4", 22, 0, {}]], [["leaky_re_lu_4", 23, 0, {}]], [["leaky_re_lu_4", 24, 0, {}]], [["leaky_re_lu_4", 25, 0, {}]], [["leaky_re_lu_4", 26, 0, {}]], [["leaky_re_lu_4", 27, 0, {}]], [["leaky_re_lu_4", 28, 0, {}]], [["leaky_re_lu_4", 29, 0, {}]], [["leaky_re_lu_4", 30, 0, {}]], [["leaky_re_lu_4", 31, 0, {}]], [["leaky_re_lu_4", 32, 0, {}]], [["leaky_re_lu_4", 33, 0, {}]], [["leaky_re_lu_4", 34, 0, {}]], [["leaky_re_lu_4", 35, 0, {}]], [["leaky_re_lu_4", 36, 0, {}]], [["leaky_re_lu_4", 37, 0, {}]], [["leaky_re_lu_4", 38, 0, {}]], [["leaky_re_lu_4", 39, 0, {}]], [["leaky_re_lu_4", 40, 0, {}]], [["leaky_re_lu_4", 41, 0, {}]], [["leaky_re_lu_4", 42, 0, {}]], [["leaky_re_lu_4", 43, 0, {}]], [["leaky_re_lu_4", 44, 0, {}]], [["leaky_re_lu_4", 45, 0, {}]], [["leaky_re_lu_4", 46, 0, {}]], [["leaky_re_lu_4", 47, 0, {}]], [["leaky_re_lu_4", 48, 0, {}]], [["leaky_re_lu_4", 49, 0, {}]], [["leaky_re_lu_4", 50, 0, {}]], [["leaky_re_lu_4", 51, 0, {}]], [["leaky_re_lu_4", 52, 0, {}]], [["leaky_re_lu_4", 53, 0, {}]], [["leaky_re_lu_4", 54, 0, {}]], [["leaky_re_lu_4", 55, 0, {}]], [["leaky_re_lu_4", 56, 0, {}]], [["leaky_re_lu_4", 57, 0, {}]], [["leaky_re_lu_4", 58, 0, {}]], [["leaky_re_lu_4", 59, 0, {}]], [["leaky_re_lu_4", 60, 0, {}]], [["leaky_re_lu_4", 61, 0, {}]], [["leaky_re_lu_4", 62, 0, {}]], [["leaky_re_lu_4", 63, 0, {}]], [["leaky_re_lu_4", 64, 0, {}]], [["leaky_re_lu_4", 65, 0, {}]], [["leaky_re_lu_4", 66, 0, {}]], [["leaky_re_lu_4", 67, 0, {}]], [["leaky_re_lu_4", 68, 0, {}]], [["leaky_re_lu_4", 69, 0, {}]], [["leaky_re_lu_4", 70, 0, {}]], [["leaky_re_lu_4", 71, 0, {}]], [["leaky_re_lu_4", 72, 0, {}]], [["leaky_re_lu_4", 73, 0, {}]], [["leaky_re_lu_4", 74, 0, {}]], [["leaky_re_lu_4", 75, 0, {}]], [["leaky_re_lu_4", 76, 0, {}]], [["leaky_re_lu_4", 77, 0, {}]], [["leaky_re_lu_4", 78, 0, {}]], [["leaky_re_lu_4", 79, 0, {}]], [["leaky_re_lu_4", 80, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_5", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_5", "inbound_nodes": [[["dense_1", 0, 0, {}]], [["dense_1", 1, 0, {}]], [["dense_1", 2, 0, {}]], [["dense_1", 3, 0, {}]], [["dense_1", 4, 0, {}]], [["dense_1", 5, 0, {}]], [["dense_1", 6, 0, {}]], [["dense_1", 7, 0, {}]], [["dense_1", 8, 0, {}]], [["dense_1", 9, 0, {}]], [["dense_1", 10, 0, {}]], [["dense_1", 11, 0, {}]], [["dense_1", 12, 0, {}]], [["dense_1", 13, 0, {}]], [["dense_1", 14, 0, {}]], [["dense_1", 15, 0, {}]], [["dense_1", 16, 0, {}]], [["dense_1", 17, 0, {}]], [["dense_1", 18, 0, {}]], [["dense_1", 19, 0, {}]], [["dense_1", 20, 0, {}]], [["dense_1", 21, 0, {}]], [["dense_1", 22, 0, {}]], [["dense_1", 23, 0, {}]], [["dense_1", 24, 0, {}]], [["dense_1", 25, 0, {}]], [["dense_1", 26, 0, {}]], [["dense_1", 27, 0, {}]], [["dense_1", 28, 0, {}]], [["dense_1", 29, 0, {}]], [["dense_1", 30, 0, {}]], [["dense_1", 31, 0, {}]], [["dense_1", 32, 0, {}]], [["dense_1", 33, 0, {}]], [["dense_1", 34, 0, {}]], [["dense_1", 35, 0, {}]], [["dense_1", 36, 0, {}]], [["dense_1", 37, 0, {}]], [["dense_1", 38, 0, {}]], [["dense_1", 39, 0, {}]], [["dense_1", 40, 0, {}]], [["dense_1", 41, 0, {}]], [["dense_1", 42, 0, {}]], [["dense_1", 43, 0, {}]], [["dense_1", 44, 0, {}]], [["dense_1", 45, 0, {}]], [["dense_1", 46, 0, {}]], [["dense_1", 47, 0, {}]], [["dense_1", 48, 0, {}]], [["dense_1", 49, 0, {}]], [["dense_1", 50, 0, {}]], [["dense_1", 51, 0, {}]], [["dense_1", 52, 0, {}]], [["dense_1", 53, 0, {}]], [["dense_1", 54, 0, {}]], [["dense_1", 55, 0, {}]], [["dense_1", 56, 0, {}]], [["dense_1", 57, 0, {}]], [["dense_1", 58, 0, {}]], [["dense_1", 59, 0, {}]], [["dense_1", 60, 0, {}]], [["dense_1", 61, 0, {}]], [["dense_1", 62, 0, {}]], [["dense_1", 63, 0, {}]], [["dense_1", 64, 0, {}]], [["dense_1", 65, 0, {}]], [["dense_1", 66, 0, {}]], [["dense_1", 67, 0, {}]], [["dense_1", 68, 0, {}]], [["dense_1", 69, 0, {}]], [["dense_1", 70, 0, {}]], [["dense_1", 71, 0, {}]], [["dense_1", 72, 0, {}]], [["dense_1", 73, 0, {}]], [["dense_1", 74, 0, {}]], [["dense_1", 75, 0, {}]], [["dense_1", 76, 0, {}]], [["dense_1", 77, 0, {}]], [["dense_1", 78, 0, {}]], [["dense_1", 79, 0, {}]], [["dense_1", 80, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_2", "inbound_nodes": [[["leaky_re_lu_5", 0, 0, {}]], [["leaky_re_lu_5", 1, 0, {}]], [["leaky_re_lu_5", 2, 0, {}]], [["leaky_re_lu_5", 3, 0, {}]], [["leaky_re_lu_5", 4, 0, {}]], [["leaky_re_lu_5", 5, 0, {}]], [["leaky_re_lu_5", 6, 0, {}]], [["leaky_re_lu_5", 7, 0, {}]], [["leaky_re_lu_5", 8, 0, {}]], [["leaky_re_lu_5", 9, 0, {}]], [["leaky_re_lu_5", 10, 0, {}]], [["leaky_re_lu_5", 11, 0, {}]], [["leaky_re_lu_5", 12, 0, {}]], [["leaky_re_lu_5", 13, 0, {}]], [["leaky_re_lu_5", 14, 0, {}]], [["leaky_re_lu_5", 15, 0, {}]], [["leaky_re_lu_5", 16, 0, {}]], [["leaky_re_lu_5", 17, 0, {}]], [["leaky_re_lu_5", 18, 0, {}]], [["leaky_re_lu_5", 19, 0, {}]], [["leaky_re_lu_5", 20, 0, {}]], [["leaky_re_lu_5", 21, 0, {}]], [["leaky_re_lu_5", 22, 0, {}]], [["leaky_re_lu_5", 23, 0, {}]], [["leaky_re_lu_5", 24, 0, {}]], [["leaky_re_lu_5", 25, 0, {}]], [["leaky_re_lu_5", 26, 0, {}]], [["leaky_re_lu_5", 27, 0, {}]], [["leaky_re_lu_5", 28, 0, {}]], [["leaky_re_lu_5", 29, 0, {}]], [["leaky_re_lu_5", 30, 0, {}]], [["leaky_re_lu_5", 31, 0, {}]], [["leaky_re_lu_5", 32, 0, {}]], [["leaky_re_lu_5", 33, 0, {}]], [["leaky_re_lu_5", 34, 0, {}]], [["leaky_re_lu_5", 35, 0, {}]], [["leaky_re_lu_5", 36, 0, {}]], [["leaky_re_lu_5", 37, 0, {}]], [["leaky_re_lu_5", 38, 0, {}]], [["leaky_re_lu_5", 39, 0, {}]], [["leaky_re_lu_5", 40, 0, {}]], [["leaky_re_lu_5", 41, 0, {}]], [["leaky_re_lu_5", 42, 0, {}]], [["leaky_re_lu_5", 43, 0, {}]], [["leaky_re_lu_5", 44, 0, {}]], [["leaky_re_lu_5", 45, 0, {}]], [["leaky_re_lu_5", 46, 0, {}]], [["leaky_re_lu_5", 47, 0, {}]], [["leaky_re_lu_5", 48, 0, {}]], [["leaky_re_lu_5", 49, 0, {}]], [["leaky_re_lu_5", 50, 0, {}]], [["leaky_re_lu_5", 51, 0, {}]], [["leaky_re_lu_5", 52, 0, {}]], [["leaky_re_lu_5", 53, 0, {}]], [["leaky_re_lu_5", 54, 0, {}]], [["leaky_re_lu_5", 55, 0, {}]], [["leaky_re_lu_5", 56, 0, {}]], [["leaky_re_lu_5", 57, 0, {}]], [["leaky_re_lu_5", 58, 0, {}]], [["leaky_re_lu_5", 59, 0, {}]], [["leaky_re_lu_5", 60, 0, {}]], [["leaky_re_lu_5", 61, 0, {}]], [["leaky_re_lu_5", 62, 0, {}]], [["leaky_re_lu_5", 63, 0, {}]], [["leaky_re_lu_5", 64, 0, {}]], [["leaky_re_lu_5", 65, 0, {}]], [["leaky_re_lu_5", 66, 0, {}]], [["leaky_re_lu_5", 67, 0, {}]], [["leaky_re_lu_5", 68, 0, {}]], [["leaky_re_lu_5", 69, 0, {}]], [["leaky_re_lu_5", 70, 0, {}]], [["leaky_re_lu_5", 71, 0, {}]], [["leaky_re_lu_5", 72, 0, {}]], [["leaky_re_lu_5", 73, 0, {}]], [["leaky_re_lu_5", 74, 0, {}]], [["leaky_re_lu_5", 75, 0, {}]], [["leaky_re_lu_5", 76, 0, {}]], [["leaky_re_lu_5", 77, 0, {}]], [["leaky_re_lu_5", 78, 0, {}]], [["leaky_re_lu_5", 79, 0, {}]], [["leaky_re_lu_5", 80, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_6", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_6", "inbound_nodes": [[["dense_2", 0, 0, {}]], [["dense_2", 1, 0, {}]], [["dense_2", 2, 0, {}]], [["dense_2", 3, 0, {}]], [["dense_2", 4, 0, {}]], [["dense_2", 5, 0, {}]], [["dense_2", 6, 0, {}]], [["dense_2", 7, 0, {}]], [["dense_2", 8, 0, {}]], [["dense_2", 9, 0, {}]], [["dense_2", 10, 0, {}]], [["dense_2", 11, 0, {}]], [["dense_2", 12, 0, {}]], [["dense_2", 13, 0, {}]], [["dense_2", 14, 0, {}]], [["dense_2", 15, 0, {}]], [["dense_2", 16, 0, {}]], [["dense_2", 17, 0, {}]], [["dense_2", 18, 0, {}]], [["dense_2", 19, 0, {}]], [["dense_2", 20, 0, {}]], [["dense_2", 21, 0, {}]], [["dense_2", 22, 0, {}]], [["dense_2", 23, 0, {}]], [["dense_2", 24, 0, {}]], [["dense_2", 25, 0, {}]], [["dense_2", 26, 0, {}]], [["dense_2", 27, 0, {}]], [["dense_2", 28, 0, {}]], [["dense_2", 29, 0, {}]], [["dense_2", 30, 0, {}]], [["dense_2", 31, 0, {}]], [["dense_2", 32, 0, {}]], [["dense_2", 33, 0, {}]], [["dense_2", 34, 0, {}]], [["dense_2", 35, 0, {}]], [["dense_2", 36, 0, {}]], [["dense_2", 37, 0, {}]], [["dense_2", 38, 0, {}]], [["dense_2", 39, 0, {}]], [["dense_2", 40, 0, {}]], [["dense_2", 41, 0, {}]], [["dense_2", 42, 0, {}]], [["dense_2", 43, 0, {}]], [["dense_2", 44, 0, {}]], [["dense_2", 45, 0, {}]], [["dense_2", 46, 0, {}]], [["dense_2", 47, 0, {}]], [["dense_2", 48, 0, {}]], [["dense_2", 49, 0, {}]], [["dense_2", 50, 0, {}]], [["dense_2", 51, 0, {}]], [["dense_2", 52, 0, {}]], [["dense_2", 53, 0, {}]], [["dense_2", 54, 0, {}]], [["dense_2", 55, 0, {}]], [["dense_2", 56, 0, {}]], [["dense_2", 57, 0, {}]], [["dense_2", 58, 0, {}]], [["dense_2", 59, 0, {}]], [["dense_2", 60, 0, {}]], [["dense_2", 61, 0, {}]], [["dense_2", 62, 0, {}]], [["dense_2", 63, 0, {}]], [["dense_2", 64, 0, {}]], [["dense_2", 65, 0, {}]], [["dense_2", 66, 0, {}]], [["dense_2", 67, 0, {}]], [["dense_2", 68, 0, {}]], [["dense_2", 69, 0, {}]], [["dense_2", 70, 0, {}]], [["dense_2", 71, 0, {}]], [["dense_2", 72, 0, {}]], [["dense_2", 73, 0, {}]], [["dense_2", 74, 0, {}]], [["dense_2", 75, 0, {}]], [["dense_2", 76, 0, {}]], [["dense_2", 77, 0, {}]], [["dense_2", 78, 0, {}]], [["dense_2", 79, 0, {}]], [["dense_2", 80, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_3", "inbound_nodes": [[["leaky_re_lu_6", 0, 0, {}]], [["leaky_re_lu_6", 1, 0, {}]], [["leaky_re_lu_6", 2, 0, {}]], [["leaky_re_lu_6", 3, 0, {}]], [["leaky_re_lu_6", 4, 0, {}]], [["leaky_re_lu_6", 5, 0, {}]], [["leaky_re_lu_6", 6, 0, {}]], [["leaky_re_lu_6", 7, 0, {}]], [["leaky_re_lu_6", 8, 0, {}]], [["leaky_re_lu_6", 9, 0, {}]], [["leaky_re_lu_6", 10, 0, {}]], [["leaky_re_lu_6", 11, 0, {}]], [["leaky_re_lu_6", 12, 0, {}]], [["leaky_re_lu_6", 13, 0, {}]], [["leaky_re_lu_6", 14, 0, {}]], [["leaky_re_lu_6", 15, 0, {}]], [["leaky_re_lu_6", 16, 0, {}]], [["leaky_re_lu_6", 17, 0, {}]], [["leaky_re_lu_6", 18, 0, {}]], [["leaky_re_lu_6", 19, 0, {}]], [["leaky_re_lu_6", 20, 0, {}]], [["leaky_re_lu_6", 21, 0, {}]], [["leaky_re_lu_6", 22, 0, {}]], [["leaky_re_lu_6", 23, 0, {}]], [["leaky_re_lu_6", 24, 0, {}]], [["leaky_re_lu_6", 25, 0, {}]], [["leaky_re_lu_6", 26, 0, {}]], [["leaky_re_lu_6", 27, 0, {}]], [["leaky_re_lu_6", 28, 0, {}]], [["leaky_re_lu_6", 29, 0, {}]], [["leaky_re_lu_6", 30, 0, {}]], [["leaky_re_lu_6", 31, 0, {}]], [["leaky_re_lu_6", 32, 0, {}]], [["leaky_re_lu_6", 33, 0, {}]], [["leaky_re_lu_6", 34, 0, {}]], [["leaky_re_lu_6", 35, 0, {}]], [["leaky_re_lu_6", 36, 0, {}]], [["leaky_re_lu_6", 37, 0, {}]], [["leaky_re_lu_6", 38, 0, {}]], [["leaky_re_lu_6", 39, 0, {}]], [["leaky_re_lu_6", 40, 0, {}]], [["leaky_re_lu_6", 41, 0, {}]], [["leaky_re_lu_6", 42, 0, {}]], [["leaky_re_lu_6", 43, 0, {}]], [["leaky_re_lu_6", 44, 0, {}]], [["leaky_re_lu_6", 45, 0, {}]], [["leaky_re_lu_6", 46, 0, {}]], [["leaky_re_lu_6", 47, 0, {}]], [["leaky_re_lu_6", 48, 0, {}]], [["leaky_re_lu_6", 49, 0, {}]], [["leaky_re_lu_6", 50, 0, {}]], [["leaky_re_lu_6", 51, 0, {}]], [["leaky_re_lu_6", 52, 0, {}]], [["leaky_re_lu_6", 53, 0, {}]], [["leaky_re_lu_6", 54, 0, {}]], [["leaky_re_lu_6", 55, 0, {}]], [["leaky_re_lu_6", 56, 0, {}]], [["leaky_re_lu_6", 57, 0, {}]], [["leaky_re_lu_6", 58, 0, {}]], [["leaky_re_lu_6", 59, 0, {}]], [["leaky_re_lu_6", 60, 0, {}]], [["leaky_re_lu_6", 61, 0, {}]], [["leaky_re_lu_6", 62, 0, {}]], [["leaky_re_lu_6", 63, 0, {}]], [["leaky_re_lu_6", 64, 0, {}]], [["leaky_re_lu_6", 65, 0, {}]], [["leaky_re_lu_6", 66, 0, {}]], [["leaky_re_lu_6", 67, 0, {}]], [["leaky_re_lu_6", 68, 0, {}]], [["leaky_re_lu_6", 69, 0, {}]], [["leaky_re_lu_6", 70, 0, {}]], [["leaky_re_lu_6", 71, 0, {}]], [["leaky_re_lu_6", 72, 0, {}]], [["leaky_re_lu_6", 73, 0, {}]], [["leaky_re_lu_6", 74, 0, {}]], [["leaky_re_lu_6", 75, 0, {}]], [["leaky_re_lu_6", 76, 0, {}]], [["leaky_re_lu_6", 77, 0, {}]], [["leaky_re_lu_6", 78, 0, {}]], [["leaky_re_lu_6", 79, 0, {}]], [["leaky_re_lu_6", 80, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_7", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_7", "inbound_nodes": [[["dense_3", 0, 0, {}]], [["dense_3", 1, 0, {}]], [["dense_3", 2, 0, {}]], [["dense_3", 3, 0, {}]], [["dense_3", 4, 0, {}]], [["dense_3", 5, 0, {}]], [["dense_3", 6, 0, {}]], [["dense_3", 7, 0, {}]], [["dense_3", 8, 0, {}]], [["dense_3", 9, 0, {}]], [["dense_3", 10, 0, {}]], [["dense_3", 11, 0, {}]], [["dense_3", 12, 0, {}]], [["dense_3", 13, 0, {}]], [["dense_3", 14, 0, {}]], [["dense_3", 15, 0, {}]], [["dense_3", 16, 0, {}]], [["dense_3", 17, 0, {}]], [["dense_3", 18, 0, {}]], [["dense_3", 19, 0, {}]], [["dense_3", 20, 0, {}]], [["dense_3", 21, 0, {}]], [["dense_3", 22, 0, {}]], [["dense_3", 23, 0, {}]], [["dense_3", 24, 0, {}]], [["dense_3", 25, 0, {}]], [["dense_3", 26, 0, {}]], [["dense_3", 27, 0, {}]], [["dense_3", 28, 0, {}]], [["dense_3", 29, 0, {}]], [["dense_3", 30, 0, {}]], [["dense_3", 31, 0, {}]], [["dense_3", 32, 0, {}]], [["dense_3", 33, 0, {}]], [["dense_3", 34, 0, {}]], [["dense_3", 35, 0, {}]], [["dense_3", 36, 0, {}]], [["dense_3", 37, 0, {}]], [["dense_3", 38, 0, {}]], [["dense_3", 39, 0, {}]], [["dense_3", 40, 0, {}]], [["dense_3", 41, 0, {}]], [["dense_3", 42, 0, {}]], [["dense_3", 43, 0, {}]], [["dense_3", 44, 0, {}]], [["dense_3", 45, 0, {}]], [["dense_3", 46, 0, {}]], [["dense_3", 47, 0, {}]], [["dense_3", 48, 0, {}]], [["dense_3", 49, 0, {}]], [["dense_3", 50, 0, {}]], [["dense_3", 51, 0, {}]], [["dense_3", 52, 0, {}]], [["dense_3", 53, 0, {}]], [["dense_3", 54, 0, {}]], [["dense_3", 55, 0, {}]], [["dense_3", 56, 0, {}]], [["dense_3", 57, 0, {}]], [["dense_3", 58, 0, {}]], [["dense_3", 59, 0, {}]], [["dense_3", 60, 0, {}]], [["dense_3", 61, 0, {}]], [["dense_3", 62, 0, {}]], [["dense_3", 63, 0, {}]], [["dense_3", 64, 0, {}]], [["dense_3", 65, 0, {}]], [["dense_3", 66, 0, {}]], [["dense_3", 67, 0, {}]], [["dense_3", 68, 0, {}]], [["dense_3", 69, 0, {}]], [["dense_3", 70, 0, {}]], [["dense_3", 71, 0, {}]], [["dense_3", 72, 0, {}]], [["dense_3", 73, 0, {}]], [["dense_3", 74, 0, {}]], [["dense_3", 75, 0, {}]], [["dense_3", 76, 0, {}]], [["dense_3", 77, 0, {}]], [["dense_3", 78, 0, {}]], [["dense_3", 79, 0, {}]], [["dense_3", 80, 0, {}]]]}, {"class_name": "Average", "config": {"name": "average", "trainable": true, "dtype": "float32"}, "name": "average", "inbound_nodes": [[["leaky_re_lu_7", 0, 0, {}], ["leaky_re_lu_7", 1, 0, {}], ["leaky_re_lu_7", 2, 0, {}], ["leaky_re_lu_7", 3, 0, {}], ["leaky_re_lu_7", 4, 0, {}], ["leaky_re_lu_7", 5, 0, {}], ["leaky_re_lu_7", 6, 0, {}], ["leaky_re_lu_7", 7, 0, {}], ["leaky_re_lu_7", 8, 0, {}], ["leaky_re_lu_7", 9, 0, {}], ["leaky_re_lu_7", 10, 0, {}], ["leaky_re_lu_7", 11, 0, {}], ["leaky_re_lu_7", 12, 0, {}], ["leaky_re_lu_7", 13, 0, {}], ["leaky_re_lu_7", 14, 0, {}], ["leaky_re_lu_7", 15, 0, {}], ["leaky_re_lu_7", 16, 0, {}], ["leaky_re_lu_7", 17, 0, {}], ["leaky_re_lu_7", 18, 0, {}], ["leaky_re_lu_7", 19, 0, {}], ["leaky_re_lu_7", 20, 0, {}], ["leaky_re_lu_7", 21, 0, {}], ["leaky_re_lu_7", 22, 0, {}], ["leaky_re_lu_7", 23, 0, {}], ["leaky_re_lu_7", 24, 0, {}], ["leaky_re_lu_7", 25, 0, {}], ["leaky_re_lu_7", 26, 0, {}], ["leaky_re_lu_7", 27, 0, {}], ["leaky_re_lu_7", 28, 0, {}], ["leaky_re_lu_7", 29, 0, {}], ["leaky_re_lu_7", 30, 0, {}], ["leaky_re_lu_7", 31, 0, {}], ["leaky_re_lu_7", 32, 0, {}], ["leaky_re_lu_7", 33, 0, {}], ["leaky_re_lu_7", 34, 0, {}], ["leaky_re_lu_7", 35, 0, {}], ["leaky_re_lu_7", 36, 0, {}], ["leaky_re_lu_7", 37, 0, {}], ["leaky_re_lu_7", 38, 0, {}], ["leaky_re_lu_7", 39, 0, {}], ["leaky_re_lu_7", 40, 0, {}], ["leaky_re_lu_7", 41, 0, {}], ["leaky_re_lu_7", 42, 0, {}], ["leaky_re_lu_7", 43, 0, {}], ["leaky_re_lu_7", 44, 0, {}], ["leaky_re_lu_7", 45, 0, {}], ["leaky_re_lu_7", 46, 0, {}], ["leaky_re_lu_7", 47, 0, {}], ["leaky_re_lu_7", 48, 0, {}], ["leaky_re_lu_7", 49, 0, {}], ["leaky_re_lu_7", 50, 0, {}], ["leaky_re_lu_7", 51, 0, {}], ["leaky_re_lu_7", 52, 0, {}], ["leaky_re_lu_7", 53, 0, {}], ["leaky_re_lu_7", 54, 0, {}], ["leaky_re_lu_7", 55, 0, {}], ["leaky_re_lu_7", 56, 0, {}], ["leaky_re_lu_7", 57, 0, {}], ["leaky_re_lu_7", 58, 0, {}], ["leaky_re_lu_7", 59, 0, {}], ["leaky_re_lu_7", 60, 0, {}], ["leaky_re_lu_7", 61, 0, {}], ["leaky_re_lu_7", 62, 0, {}], ["leaky_re_lu_7", 63, 0, {}], ["leaky_re_lu_7", 64, 0, {}], ["leaky_re_lu_7", 65, 0, {}], ["leaky_re_lu_7", 66, 0, {}], ["leaky_re_lu_7", 67, 0, {}], ["leaky_re_lu_7", 68, 0, {}], ["leaky_re_lu_7", 69, 0, {}], ["leaky_re_lu_7", 70, 0, {}], ["leaky_re_lu_7", 71, 0, {}], ["leaky_re_lu_7", 72, 0, {}], ["leaky_re_lu_7", 73, 0, {}], ["leaky_re_lu_7", 74, 0, {}], ["leaky_re_lu_7", 75, 0, {}], ["leaky_re_lu_7", 76, 0, {}], ["leaky_re_lu_7", 77, 0, {}], ["leaky_re_lu_7", 78, 0, {}], ["leaky_re_lu_7", 79, 0, {}], ["leaky_re_lu_7", 80, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_4", "inbound_nodes": [[["average", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_8", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_8", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["leaky_re_lu_8", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_5", "inbound_nodes": [[["dropout", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_9", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_9", "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "dtype": "float32", "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_6", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_10", "trainable": true, "dtype": "float32", "alpha": 0.20000000298023224}, "name": "leaky_re_lu_10", "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense_7", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_7", 0, 0]]}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}