{"class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 116, 116, 1], "dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": []}, {"name": "conv2d_1", "class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "batch_input_shape": [null, 116, 116, 1], "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "max_pooling2d_1", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"name": "conv2d_2", "class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "max_pooling2d_2", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"name": "conv2d_3", "class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "max_pooling2d_3", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_3", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}]]]}, {"name": "conv2d_4", "class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [2, 2], "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "max_pooling2d_4", "class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_4", "trainable": true, "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "trainable": true, "axis": -1, "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"name": "lambda_1", "class_name": "Lambda", "config": {"name": "lambda_1", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcxwAAAB8AGQAZACFAmQBZABkAIUCZABkAIUCZgQZAFMAKQJO\n6QAAAACpACkB2gF0cgIAAAByAgAAAPobZGlsYXRlX0NOTl9STl9leHByZXNzaXZlLnB52g1nZXRf\ndG9wX2RpbV8xfgAAAHMCAAAAAAE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]], [["lambda_2", 0, 0, {}]], [["lambda_2", 1, 0, {}]]]}, {"name": "lambda_2", "class_name": "Lambda", "config": {"name": "lambda_2", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAYAAABTAAAAcyAAAAB8AGQAZACFAmQBZACFAmQAZACFAmQAZACFAmYEGQBT\nACkCTukBAAAAqQApAdoBdHICAAAAcgIAAAD6G2RpbGF0ZV9DTk5fUk5fZXhwcmVzc2l2ZS5wedoV\nZ2V0X2FsbF9idXRfdG9wX2RpbV8xgQAAAHMCAAAAAAE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]], [["lambda_2", 0, 0, {}]]]}, {"name": "lambda_4", "class_name": "Lambda", "config": {"name": "lambda_4", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxoAAAB8AGQAZACFAmQBZACFAmQAZACFAmYDGQBTACkCTukB\nAAAAqQApAdoBdHICAAAAcgIAAAD6G2RpbGF0ZV9DTk5fUk5fZXhwcmVzc2l2ZS5wedoVZ2V0X2Fs\nbF9idXRfdG9wX2RpbV8yhwAAAHMCAAAAAAE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_4", 0, 0, {}]], [["lambda_1", 1, 0, {}]], [["lambda_4", 2, 0, {}]], [["lambda_1", 2, 0, {}]], [["lambda_4", 4, 0, {}]]]}, {"name": "lambda_3", "class_name": "Lambda", "config": {"name": "lambda_3", "trainable": true, "function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcxYAAAB8AGQAZACFAmQBZABkAIUCZgMZAFMAKQJO6QAAAACp\nACkB2gF0cgIAAAByAgAAAPobZGlsYXRlX0NOTl9STl9leHByZXNzaXZlLnB52g1nZXRfdG9wX2Rp\nbV8yhAAAAHMCAAAAAAE=\n", null, null], "function_type": "lambda", "output_shape": null, "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["lambda_1", 0, 0, {}]], [["lambda_4", 0, 0, {}]], [["lambda_4", 1, 0, {}]], [["lambda_1", 1, 0, {}]], [["lambda_4", 2, 0, {}]], [["lambda_4", 3, 0, {}]], [["lambda_1", 2, 0, {}]], [["lambda_4", 4, 0, {}]], [["lambda_4", 5, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "inbound_nodes": [[["lambda_3", 0, 0, {}], ["lambda_3", 1, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_3", 2, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_3", 3, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_3", 4, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_3", 5, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_3", 6, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_3", 7, 0, {}]], [["lambda_3", 0, 0, {}], ["lambda_3", 8, 0, {}]], [["lambda_3", 1, 0, {}], ["lambda_3", 2, 0, {}]], [["lambda_3", 1, 0, {}], ["lambda_3", 3, 0, {}]], [["lambda_3", 1, 0, {}], ["lambda_3", 4, 0, {}]], [["lambda_3", 1, 0, {}], ["lambda_3", 5, 0, {}]], [["lambda_3", 1, 0, {}], ["lambda_3", 6, 0, {}]], [["lambda_3", 1, 0, {}], ["lambda_3", 7, 0, {}]], [["lambda_3", 1, 0, {}], ["lambda_3", 8, 0, {}]], [["lambda_3", 2, 0, {}], ["lambda_3", 3, 0, {}]], [["lambda_3", 2, 0, {}], ["lambda_3", 4, 0, {}]], [["lambda_3", 2, 0, {}], ["lambda_3", 5, 0, {}]], [["lambda_3", 2, 0, {}], ["lambda_3", 6, 0, {}]], [["lambda_3", 2, 0, {}], ["lambda_3", 7, 0, {}]], [["lambda_3", 2, 0, {}], ["lambda_3", 8, 0, {}]], [["lambda_3", 3, 0, {}], ["lambda_3", 4, 0, {}]], [["lambda_3", 3, 0, {}], ["lambda_3", 5, 0, {}]], [["lambda_3", 3, 0, {}], ["lambda_3", 6, 0, {}]], [["lambda_3", 3, 0, {}], ["lambda_3", 7, 0, {}]], [["lambda_3", 3, 0, {}], ["lambda_3", 8, 0, {}]], [["lambda_3", 4, 0, {}], ["lambda_3", 5, 0, {}]], [["lambda_3", 4, 0, {}], ["lambda_3", 6, 0, {}]], [["lambda_3", 4, 0, {}], ["lambda_3", 7, 0, {}]], [["lambda_3", 4, 0, {}], ["lambda_3", 8, 0, {}]], [["lambda_3", 5, 0, {}], ["lambda_3", 6, 0, {}]], [["lambda_3", 5, 0, {}], ["lambda_3", 7, 0, {}]], [["lambda_3", 5, 0, {}], ["lambda_3", 8, 0, {}]], [["lambda_3", 6, 0, {}], ["lambda_3", 7, 0, {}]], [["lambda_3", 6, 0, {}], ["lambda_3", 8, 0, {}]], [["lambda_3", 7, 0, {}], ["lambda_3", 8, 0, {}]]]}, {"name": "dense_1", "class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]], [["concatenate_1", 1, 0, {}]], [["concatenate_1", 2, 0, {}]], [["concatenate_1", 3, 0, {}]], [["concatenate_1", 4, 0, {}]], [["concatenate_1", 5, 0, {}]], [["concatenate_1", 6, 0, {}]], [["concatenate_1", 7, 0, {}]], [["concatenate_1", 8, 0, {}]], [["concatenate_1", 9, 0, {}]], [["concatenate_1", 10, 0, {}]], [["concatenate_1", 11, 0, {}]], [["concatenate_1", 12, 0, {}]], [["concatenate_1", 13, 0, {}]], [["concatenate_1", 14, 0, {}]], [["concatenate_1", 15, 0, {}]], [["concatenate_1", 16, 0, {}]], [["concatenate_1", 17, 0, {}]], [["concatenate_1", 18, 0, {}]], [["concatenate_1", 19, 0, {}]], [["concatenate_1", 20, 0, {}]], [["concatenate_1", 21, 0, {}]], [["concatenate_1", 22, 0, {}]], [["concatenate_1", 23, 0, {}]], [["concatenate_1", 24, 0, {}]], [["concatenate_1", 25, 0, {}]], [["concatenate_1", 26, 0, {}]], [["concatenate_1", 27, 0, {}]], [["concatenate_1", 28, 0, {}]], [["concatenate_1", 29, 0, {}]], [["concatenate_1", 30, 0, {}]], [["concatenate_1", 31, 0, {}]], [["concatenate_1", 32, 0, {}]], [["concatenate_1", 33, 0, {}]], [["concatenate_1", 34, 0, {}]], [["concatenate_1", 35, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_1", 0, 0, {}]], [["dense_1", 1, 0, {}]], [["dense_1", 2, 0, {}]], [["dense_1", 3, 0, {}]], [["dense_1", 4, 0, {}]], [["dense_1", 5, 0, {}]], [["dense_1", 6, 0, {}]], [["dense_1", 7, 0, {}]], [["dense_1", 8, 0, {}]], [["dense_1", 9, 0, {}]], [["dense_1", 10, 0, {}]], [["dense_1", 11, 0, {}]], [["dense_1", 12, 0, {}]], [["dense_1", 13, 0, {}]], [["dense_1", 14, 0, {}]], [["dense_1", 15, 0, {}]], [["dense_1", 16, 0, {}]], [["dense_1", 17, 0, {}]], [["dense_1", 18, 0, {}]], [["dense_1", 19, 0, {}]], [["dense_1", 20, 0, {}]], [["dense_1", 21, 0, {}]], [["dense_1", 22, 0, {}]], [["dense_1", 23, 0, {}]], [["dense_1", 24, 0, {}]], [["dense_1", 25, 0, {}]], [["dense_1", 26, 0, {}]], [["dense_1", 27, 0, {}]], [["dense_1", 28, 0, {}]], [["dense_1", 29, 0, {}]], [["dense_1", 30, 0, {}]], [["dense_1", 31, 0, {}]], [["dense_1", 32, 0, {}]], [["dense_1", 33, 0, {}]], [["dense_1", 34, 0, {}]], [["dense_1", 35, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_1", 0, 0, {}]], [["activation_1", 1, 0, {}]], [["activation_1", 2, 0, {}]], [["activation_1", 3, 0, {}]], [["activation_1", 4, 0, {}]], [["activation_1", 5, 0, {}]], [["activation_1", 6, 0, {}]], [["activation_1", 7, 0, {}]], [["activation_1", 8, 0, {}]], [["activation_1", 9, 0, {}]], [["activation_1", 10, 0, {}]], [["activation_1", 11, 0, {}]], [["activation_1", 12, 0, {}]], [["activation_1", 13, 0, {}]], [["activation_1", 14, 0, {}]], [["activation_1", 15, 0, {}]], [["activation_1", 16, 0, {}]], [["activation_1", 17, 0, {}]], [["activation_1", 18, 0, {}]], [["activation_1", 19, 0, {}]], [["activation_1", 20, 0, {}]], [["activation_1", 21, 0, {}]], [["activation_1", 22, 0, {}]], [["activation_1", 23, 0, {}]], [["activation_1", 24, 0, {}]], [["activation_1", 25, 0, {}]], [["activation_1", 26, 0, {}]], [["activation_1", 27, 0, {}]], [["activation_1", 28, 0, {}]], [["activation_1", 29, 0, {}]], [["activation_1", 30, 0, {}]], [["activation_1", 31, 0, {}]], [["activation_1", 32, 0, {}]], [["activation_1", 33, 0, {}]], [["activation_1", 34, 0, {}]], [["activation_1", 35, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_2", 0, 0, {}]], [["dense_2", 1, 0, {}]], [["dense_2", 2, 0, {}]], [["dense_2", 3, 0, {}]], [["dense_2", 4, 0, {}]], [["dense_2", 5, 0, {}]], [["dense_2", 6, 0, {}]], [["dense_2", 7, 0, {}]], [["dense_2", 8, 0, {}]], [["dense_2", 9, 0, {}]], [["dense_2", 10, 0, {}]], [["dense_2", 11, 0, {}]], [["dense_2", 12, 0, {}]], [["dense_2", 13, 0, {}]], [["dense_2", 14, 0, {}]], [["dense_2", 15, 0, {}]], [["dense_2", 16, 0, {}]], [["dense_2", 17, 0, {}]], [["dense_2", 18, 0, {}]], [["dense_2", 19, 0, {}]], [["dense_2", 20, 0, {}]], [["dense_2", 21, 0, {}]], [["dense_2", 22, 0, {}]], [["dense_2", 23, 0, {}]], [["dense_2", 24, 0, {}]], [["dense_2", 25, 0, {}]], [["dense_2", 26, 0, {}]], [["dense_2", 27, 0, {}]], [["dense_2", 28, 0, {}]], [["dense_2", 29, 0, {}]], [["dense_2", 30, 0, {}]], [["dense_2", 31, 0, {}]], [["dense_2", 32, 0, {}]], [["dense_2", 33, 0, {}]], [["dense_2", 34, 0, {}]], [["dense_2", 35, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_2", 0, 0, {}]], [["activation_2", 1, 0, {}]], [["activation_2", 2, 0, {}]], [["activation_2", 3, 0, {}]], [["activation_2", 4, 0, {}]], [["activation_2", 5, 0, {}]], [["activation_2", 6, 0, {}]], [["activation_2", 7, 0, {}]], [["activation_2", 8, 0, {}]], [["activation_2", 9, 0, {}]], [["activation_2", 10, 0, {}]], [["activation_2", 11, 0, {}]], [["activation_2", 12, 0, {}]], [["activation_2", 13, 0, {}]], [["activation_2", 14, 0, {}]], [["activation_2", 15, 0, {}]], [["activation_2", 16, 0, {}]], [["activation_2", 17, 0, {}]], [["activation_2", 18, 0, {}]], [["activation_2", 19, 0, {}]], [["activation_2", 20, 0, {}]], [["activation_2", 21, 0, {}]], [["activation_2", 22, 0, {}]], [["activation_2", 23, 0, {}]], [["activation_2", 24, 0, {}]], [["activation_2", 25, 0, {}]], [["activation_2", 26, 0, {}]], [["activation_2", 27, 0, {}]], [["activation_2", 28, 0, {}]], [["activation_2", 29, 0, {}]], [["activation_2", 30, 0, {}]], [["activation_2", 31, 0, {}]], [["activation_2", 32, 0, {}]], [["activation_2", 33, 0, {}]], [["activation_2", 34, 0, {}]], [["activation_2", 35, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_3", 0, 0, {}]], [["dense_3", 1, 0, {}]], [["dense_3", 2, 0, {}]], [["dense_3", 3, 0, {}]], [["dense_3", 4, 0, {}]], [["dense_3", 5, 0, {}]], [["dense_3", 6, 0, {}]], [["dense_3", 7, 0, {}]], [["dense_3", 8, 0, {}]], [["dense_3", 9, 0, {}]], [["dense_3", 10, 0, {}]], [["dense_3", 11, 0, {}]], [["dense_3", 12, 0, {}]], [["dense_3", 13, 0, {}]], [["dense_3", 14, 0, {}]], [["dense_3", 15, 0, {}]], [["dense_3", 16, 0, {}]], [["dense_3", 17, 0, {}]], [["dense_3", 18, 0, {}]], [["dense_3", 19, 0, {}]], [["dense_3", 20, 0, {}]], [["dense_3", 21, 0, {}]], [["dense_3", 22, 0, {}]], [["dense_3", 23, 0, {}]], [["dense_3", 24, 0, {}]], [["dense_3", 25, 0, {}]], [["dense_3", 26, 0, {}]], [["dense_3", 27, 0, {}]], [["dense_3", 28, 0, {}]], [["dense_3", 29, 0, {}]], [["dense_3", 30, 0, {}]], [["dense_3", 31, 0, {}]], [["dense_3", 32, 0, {}]], [["dense_3", 33, 0, {}]], [["dense_3", 34, 0, {}]], [["dense_3", 35, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_3", 0, 0, {}]], [["activation_3", 1, 0, {}]], [["activation_3", 2, 0, {}]], [["activation_3", 3, 0, {}]], [["activation_3", 4, 0, {}]], [["activation_3", 5, 0, {}]], [["activation_3", 6, 0, {}]], [["activation_3", 7, 0, {}]], [["activation_3", 8, 0, {}]], [["activation_3", 9, 0, {}]], [["activation_3", 10, 0, {}]], [["activation_3", 11, 0, {}]], [["activation_3", 12, 0, {}]], [["activation_3", 13, 0, {}]], [["activation_3", 14, 0, {}]], [["activation_3", 15, 0, {}]], [["activation_3", 16, 0, {}]], [["activation_3", 17, 0, {}]], [["activation_3", 18, 0, {}]], [["activation_3", 19, 0, {}]], [["activation_3", 20, 0, {}]], [["activation_3", 21, 0, {}]], [["activation_3", 22, 0, {}]], [["activation_3", 23, 0, {}]], [["activation_3", 24, 0, {}]], [["activation_3", 25, 0, {}]], [["activation_3", 26, 0, {}]], [["activation_3", 27, 0, {}]], [["activation_3", 28, 0, {}]], [["activation_3", 29, 0, {}]], [["activation_3", 30, 0, {}]], [["activation_3", 31, 0, {}]], [["activation_3", 32, 0, {}]], [["activation_3", 33, 0, {}]], [["activation_3", 34, 0, {}]], [["activation_3", 35, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_4", 0, 0, {}]], [["dense_4", 1, 0, {}]], [["dense_4", 2, 0, {}]], [["dense_4", 3, 0, {}]], [["dense_4", 4, 0, {}]], [["dense_4", 5, 0, {}]], [["dense_4", 6, 0, {}]], [["dense_4", 7, 0, {}]], [["dense_4", 8, 0, {}]], [["dense_4", 9, 0, {}]], [["dense_4", 10, 0, {}]], [["dense_4", 11, 0, {}]], [["dense_4", 12, 0, {}]], [["dense_4", 13, 0, {}]], [["dense_4", 14, 0, {}]], [["dense_4", 15, 0, {}]], [["dense_4", 16, 0, {}]], [["dense_4", 17, 0, {}]], [["dense_4", 18, 0, {}]], [["dense_4", 19, 0, {}]], [["dense_4", 20, 0, {}]], [["dense_4", 21, 0, {}]], [["dense_4", 22, 0, {}]], [["dense_4", 23, 0, {}]], [["dense_4", 24, 0, {}]], [["dense_4", 25, 0, {}]], [["dense_4", 26, 0, {}]], [["dense_4", 27, 0, {}]], [["dense_4", 28, 0, {}]], [["dense_4", 29, 0, {}]], [["dense_4", 30, 0, {}]], [["dense_4", 31, 0, {}]], [["dense_4", 32, 0, {}]], [["dense_4", 33, 0, {}]], [["dense_4", 34, 0, {}]], [["dense_4", 35, 0, {}]]]}, {"name": "average_1", "class_name": "Average", "config": {"name": "average_1", "trainable": true}, "inbound_nodes": [[["activation_4", 0, 0, {}], ["activation_4", 1, 0, {}], ["activation_4", 2, 0, {}], ["activation_4", 3, 0, {}], ["activation_4", 4, 0, {}], ["activation_4", 5, 0, {}], ["activation_4", 6, 0, {}], ["activation_4", 7, 0, {}], ["activation_4", 8, 0, {}], ["activation_4", 9, 0, {}], ["activation_4", 10, 0, {}], ["activation_4", 11, 0, {}], ["activation_4", 12, 0, {}], ["activation_4", 13, 0, {}], ["activation_4", 14, 0, {}], ["activation_4", 15, 0, {}], ["activation_4", 16, 0, {}], ["activation_4", 17, 0, {}], ["activation_4", 18, 0, {}], ["activation_4", 19, 0, {}], ["activation_4", 20, 0, {}], ["activation_4", 21, 0, {}], ["activation_4", 22, 0, {}], ["activation_4", 23, 0, {}], ["activation_4", 24, 0, {}], ["activation_4", 25, 0, {}], ["activation_4", 26, 0, {}], ["activation_4", 27, 0, {}], ["activation_4", 28, 0, {}], ["activation_4", 29, 0, {}], ["activation_4", 30, 0, {}], ["activation_4", 31, 0, {}], ["activation_4", 32, 0, {}], ["activation_4", 33, 0, {}], ["activation_4", 34, 0, {}], ["activation_4", 35, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["average_1", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"name": "dense_6", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_6", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.5, "noise_shape": null, "seed": null}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "dense_7", "class_name": "Dense", "config": {"name": "dense_7", "trainable": true, "units": 512, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"name": "activation_7", "class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["dense_7", 0, 0, {}]]]}, {"name": "dense_8", "class_name": "Dense", "config": {"name": "dense_8", "trainable": true, "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["activation_7", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_8", 0, 0]]}, "keras_version": "2.2.4", "backend": "tensorflow"}